In [1]:
import numpy as np
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

### DataFrames

In [6]:
from numpy.random import randn

In [7]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [8]:
df

          W         X         Y         Z
A -0.482501  0.889724 -0.668669 -0.668780
B  0.446047 -0.369871  1.611470  0.548252
C  0.292508  1.122801  1.116483  0.217665
D  0.949622 -1.173822  0.704487 -1.154571
E  0.546680 -0.425425  0.937891  0.054580

In [9]:
df['new'] = df['W'] + df['Y']

In [10]:
df

          W         X         Y         Z       new
A -0.482501  0.889724 -0.668669 -0.668780 -1.151170
B  0.446047 -0.369871  1.611470  0.548252  2.057518
C  0.292508  1.122801  1.116483  0.217665  1.408991
D  0.949622 -1.173822  0.704487 -1.154571  1.654109
E  0.546680 -0.425425  0.937891  0.054580  1.484571

In [11]:
df.drop('new',axis=1,inplace=True)

In [12]:
df

          W         X         Y         Z
A -0.482501  0.889724 -0.668669 -0.668780
B  0.446047 -0.369871  1.611470  0.548252
C  0.292508  1.122801  1.116483  0.217665
D  0.949622 -1.173822  0.704487 -1.154571
E  0.546680 -0.425425  0.937891  0.054580

### Conditional Selection

In [13]:
df>0

       W      X      Y      Z
A  False   True  False  False
B   True  False   True   True
C   True   True   True   True
D   True  False   True  False
E   True  False   True   True

In [14]:
df[df>0]

          W         X         Y         Z
A       NaN  0.889724       NaN       NaN
B  0.446047       NaN  1.611470  0.548252
C  0.292508  1.122801  1.116483  0.217665
D  0.949622       NaN  0.704487       NaN
E  0.546680       NaN  0.937891  0.054580

In [15]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A -0.482501  0.889724 -0.668669 -0.668780
1     B  0.446047 -0.369871  1.611470  0.548252
2     C  0.292508  1.122801  1.116483  0.217665
3     D  0.949622 -1.173822  0.704487 -1.154571
4     E  0.546680 -0.425425  0.937891  0.054580

In [17]:
newind = 'CA NY WY OR CO'.split()
df['States'] = newind
df.set_index('States')

               W         X         Y         Z
States
CA     -0.482501  0.889724 -0.668669 -0.668780
NY      0.446047 -0.369871  1.611470  0.548252
WY      0.292508  1.122801  1.116483  0.217665
OR      0.949622 -1.173822  0.704487 -1.154571
CO      0.546680 -0.425425  0.937891  0.054580

### Missing Data

In [18]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [19]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [20]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [22]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [23]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [24]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby

In [26]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [27]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [28]:
by_comp = df.groupby("Company")

In [32]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

### Merging, Joining, and Concatenating

In [33]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [34]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [35]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [36]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [37]:
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [38]:
pd.concat([df1,df2],axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

### Merging

In [39]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [40]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [41]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [42]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

### Operations

In [43]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [44]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [45]:
df['col2'].nunique()

3

In [46]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [47]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [48]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying functions

In [49]:
def times2(x):
    return x*2

In [50]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [51]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [52]:
df['col1'].sum()

10

In [53]:
del df['col1']

In [54]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [55]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [56]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False